%请写一个函数CONV2_NEW实现MATLAB中的二维卷积函数CONV2功能，请用例子检查你写的CONV2_NEW与CONV2的输出是否一致%
A=[1 2 3;4 5 6;7 8 9];
B=[-1 -2 -3;-4 -5 -6;-7 -8 -9];
C1 =conv2_New(A,B);
C2 =conv2(A,B);
disp('CONV2_New的输出：');
disp(C1);
disp('CONV2的输出：');
disp(C2);
%>> additional_question1
% CONV2_New的输出：
%     -1    -4   -10   -12    -9
%     -8   -26   -56   -54   -36
%    -30   -84  -165  -144   -90
%    -56  -134  -236  -186  -108
%    -49  -112  -190  -144   -81

% CONV2的输出：
%     -1    -4   -10   -12    -9
%     -8   -26   -56   -54   -36
%    -30   -84  -165  -144   -90
%    -56  -134  -236  -186  -108
%    -49  -112  -190  -144   -81 